{
  "author": "Sajag Subedi",
  "data": [
    {
      "id": "0",
      "Title": "RISE OF COMPUTERS",
      "SubTitle": "A Brief History",
      "Description": "Computers have come a long way since the first electronic computers were developed in the mid-20th century. These early computers were massive machines that took up entire rooms and were primarily used for scientific and military purposes. They required specialized training to operate and were only available to a select few.\r\n\r\n\r\tOver time, computers have become smaller, faster, and more powerful, making them more widely available and easier to use. This has led to the widespread adoption of computers in businesses, homes, and schools, and has contributed to the development of many new industries and technologies.\r\n\r\n\r\tOne of the major driving forces behind the rise of computers has been the development of the Internet. The Internet has revolutionized the way we communicate, access information, and do business, and it has made it possible for people all over the world to connect and collaborate in ways that were previously unimaginable.\r\n\r\n\r\tThe rise of computers has also had significant social and economic impacts. It has led to the creation of new jobs and industries, and has changed the way we work and communicate. However, it has also led to some negative consequences, such as job automation and the potential for increased surveillance. \r\n\r\n\r\t Despite these challenges, the rise of computers has been an undeniable force for progress, and it will continue to shape the way we live and work in the future. From the early days of the mainframe computers to the powerful and portable devices we use today, the evolution of computers has changed the world in countless ways. So, the rise of computers is a very important part of human history.",
      "imgUrl": "https://source.unsplash.com/720x600/?Computer,PC,Laptop",
      "publishedAt": "01/12/2022",
      "urlToBlog": "/blogs/riseofcomputer"
    },
    {
      "id": "1",
      "Title": "HTML",
      "SubTitle": "Building Block of a webpage",
      "Description": "HTML, which stands for Hypertext Markup Language, is a programming language used to create and structure content on the World Wide Web. It is the foundation of most websites and is used to define the structure and layout of web pages by using a variety of tags and elements.\r\n\r\n\r\tHTML consists of a series of elements, or tags, that are used to define the different parts of a web page. These elements include headings, paragraphs, lists, links, images, and more. They are denoted by angle brackets, and most elements have an opening and a closing tag. For example, a paragraph element is denoted by the <p> tag, and the corresponding closing tag is </p>. The content of the element goes in between the opening and closing tags. \n \n \tHTML also has a number of attributes that can be used to provide additional information about an element. For example, the href attribute is used to specify the destination of a link, and the src attribute is used to specify the source of an image. \n \n \tIn addition to the basic HTML tags and attributes, there are also a number of more advanced features that can be used to enhance the functionality and design of a website. These include the ability to create tables, forms, and frames; to add style and layout with CSS; and to add interactivity with JavaScript. \n \n \tOverall, HTML is an essential tool for creating and structuring content on the web. It allows developers to define the structure and layout of a web page, and to add a wide range of functionality and design elements. Whether you're a beginner looking to learn HTML or an experienced developer looking to improve your skills, understanding the basics of HTML is essential for anyone interested in creating and maintaining a website.",
      "imgUrl": "https://source.unsplash.com/720x600/?HTML,Programming",
      "publishedAt": "10/12/2022",
      "urlToBlog": "/blogs/html"
    },
    {
      "id": "2",
      "Title": "CSS",
      "SubTitle": "Beautiness of a webpage",
      "Description": "CSS (Cascading Style Sheets) is a stylesheet language used to describe the appearance of a document written in HTML or XML. It is a simple yet powerful tool that enables developers to control the look and feel of their web content. \n \n \tOne of the benefits of using CSS is that it allows developers to separate the presentation of a website from its content. This makes it easier to maintain and update a website, as changes to the stylesheet will be reflected across the entire site. It also enables developers to create consistent, visually appealing designs across multiple pages. \n \n \tTo use CSS, developers can either include a link to an external stylesheet in the HTML file or write the styles directly in the HTML file using a <style> tag. CSS styles are applied to HTML elements by specifying the element's selector and the styles that should be applied to it. CSS provides a wide range of properties that can be used to style elements, including properties for setting colors, fonts, margins, padding, and much more. Developers can also use CSS to control the layout of a page, such as by setting the position of elements or defining how elements should be displayed in different screen sizes using responsive design techniques. \n \n \t One of the most powerful features of CSS is its ability to cascade, or build on top of, other styles. This allows developers to create a base set of styles that can be extended and modified for specific situations. For example, you could define a set of styles for all paragraphs and then create additional styles for paragraphs within a specific section of the page. The cascading feature of CSS enables developers to create complex and flexible designs without having to write a large amount of code. \n \n \t Overall, CSS is an essential tool for web developers that allows them to create visually appealing and functional websites. It provides a wide range of options for styling and layout, and its cascading feature enables developers to build on top of existing styles to create complex designs ",
      "imgUrl": "https://source.unsplash.com/720x600/?CSS,HTML",
      "publishedAt": "20/12/2022",
      "urlToBlog": "/blogs/css"
    },
    {
      "id": "3",
      "Title": "JavaScript",
      "SubTitle": "The Brain of the webpage",
      "Description": "JavaScript is a programming language that is widely used to add interactivity to websites. It is a powerful and flexible language that has a variety of uses, including creating animations, handling user input, and building web applications. \n \n \tOne of the main benefits of using JavaScript is that it runs natively in the user's web browser, which means that it can interact with the user's device and environment in ways that other languages, such as HTML and CSS, cannot. This makes JavaScript a popular choice for building interactive web experiences and web applications. \n \n \tTo use JavaScript, developers can include it in their HTML files using a <script> tag. JavaScript code is executed by the browser when the page loads, and it can be used to manipulate the HTML and CSS of the page in real-time. For example, you could use JavaScript to change the color of a button when it is clicked or to show and hide elements on the page. \n \n \tJavaScript also provides a wide range of features and functions for working with data and building logical structures, such as loops and conditional statements. This makes it a powerful language for building complex applications and handling data processing tasks. \n \n \tIn addition to its use on the web, JavaScript is also used to build native applications for mobile and desktop devices. There are a variety of frameworks and tools available for building applications with JavaScript, such as React, Angular, and Electron. \r\n\r\n\r\tOverall, JavaScript is an essential tool for web developers that enables them to build interactive and dynamic web experiences. It is a versatile and powerful language that can be used for a wide range of tasks, from simple animations to complex applications.",
      "imgUrl": "https://source.unsplash.com/720x600/?Programming,coding",
      "publishedAt": "30/12/2022",
      "urlToBlog": "/blogs/javascript"
    },
    {
      "id": "4",
      "Title": "ReactJs",
      "SubTitle": "An amazing library of JavaScript",
      "Description": "React is a JavaScript library for building user interfaces. It was developed by Facebook and has become one of the most popular choices for building web and mobile applications. \n \n \tOne of the main benefits of using React is that it allows developers to create reusable components that can be easily shared and integrated into other parts of the application. This makes it easier to build and maintain large, complex applications, as changes to a component will be reflected across the entire application. \n \n \tReact also uses a virtual DOM (Document Object Model) to optimize updates to the user interface. When a component's state changes, React will efficiently update the DOM to reflect those changes. This helps to improve the performance of React applications, especially for applications that handle large amounts of data or updates to the user interface. \n \n \tTo use React, developers can include it in their project using a package manager such as npm or yarn. React components are typically written in JSX, a syntax extension for JavaScript that allows developers to write HTML-like code in their JavaScript files. \n \n \tReact is often used in combination with other libraries and frameworks, such as Redux for state management or React Router for routing. It is also compatible with a wide range of tools and libraries, making it a flexible choice for building web and mobile applications. \n \n \tOverall, React is a popular and powerful choice for building user interfaces that is easy to learn and integrate into a variety of projects. Its reusable components and virtual DOM make it a fast and efficient choice for building complex applications.",
      "imgUrl": "https://source.unsplash.com/720x600/?coding, programming,javascript, react,",
      "publishedAt": "01/01/2023",
      "urlToBlog": "/blogs/reactjs"
    },
    {
      "id": "5",
      "Title": "NodeJs",
      "SubTitle": "ServerSide JavaScript ",
      "Description": "Node.js is a popular open-source JavaScript runtime environment that is designed for building scalable network applications. It allows developers to run JavaScript on the server-side, which was previously only possible on the client-side (in the browser). \n \n \tOne of the main benefits of Node.js is its ability to handle high levels of concurrency. It uses an event-driven, non-blocking I/O model, which means that it can handle a large number of connections simultaneously with minimal overhead. This makes it an ideal choice for building real-time applications such as chat programs, online games, and live-streaming platforms. \n \n \tNode.js also has a large and active community of developers, which has contributed to the development of a vast ecosystem of tools and libraries. This makes it easy for developers to find solutions to common problems and quickly build robust applications. \n \n \tIn addition to its performance and community support, Node.js is also easy to learn and use. It is built on JavaScript, which is a widely-used programming language, and it has a simple and intuitive syntax. This makes it a good choice for developers who are new to server-side programming or who are familiar with JavaScript. \n \n \tOverall, Node.js is a powerful and versatile platform that is well-suited for building scalable network applications. Its non-blocking I/O model, large ecosystem of tools and libraries, and ease of use make it an attractive choice for many developers",
      "imgUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSXiIF6EQjDF0eTpBYckIFadQ2DUyTdCshQ8A&usqp=CAU",
      "publishedAt": "07/01/2023",
      "urlToBlog": "/blogs/nodejs"
    },
    {
      "id": "6",
      "Title": "MongoDb",
      "SubTitle": "Best No Sql DataBase",
      "Description": "MongoDB is an open-source document-oriented database management system developed by MongoDB Inc. It is classified as a NoSQL database, meaning that it does not use the traditional SQL tabular relational database structure. Instead, it uses JSON-like documents with optional schemas to store data.\r\n\r\n\r\tMongoDB is known for its flexibility, scalability, and high performance. It is used by many large organizations such as eBay, MetLife, and Expedia, as well as many smaller startups and individual developers.\r\n\r\n\r\tOne of the key features of MongoDB is its ability to handle large volumes of data without sacrificing performance. It does this through the use of horizontal scaling, also known as sharding, which allows the database to be distributed across multiple servers. This enables it to handle high levels of read and write throughput, making it well-suited for real-time analytics and other data-intensive applications.\r\n\r\n\r\tAnother important feature of MongoDB is its support for flexible and dynamic schemas. In traditional SQL databases, the schema must be defined before data can be inserted. With MongoDB, however, the schema can be changed on the fly to accommodate new data. This makes it easier to work with data that has a high degree of variability, such as that found in social media and other web-based applications.\r\n\r\n\r\tIn addition to its core database engine, MongoDB also includes a number of tools and utilities for managing and analyzing data. These include the MongoDB Compass GUI, which allows users to visualize and manipulate data, and the MongoDB Aggregation Framework, which enables data to be processed and transformed in a flexible and powerful way.\r\n\r\n\r\tOne of the main advantages of MongoDB is its ability to scale out horizontally across multiple servers. This is done through the use of sharding, which allows the database to be divided into smaller, more manageable chunks called shards. Each shard is then stored on a separate server, allowing the database to scale out to meet the needs of the application.\r\n\r\n\r\tIn addition to its scalability, MongoDB is also known for its high performance. It is designed to be able to handle high levels of read and write throughput, making it well-suited for real-time analytics and other data-intensive applications. It is also able to handle large volumes of data without sacrificing performance, thanks to its use of indexes and other optimization techniques.\r\n\r\n\r\tOverall, MongoDB is a powerful and flexible database management system that is well-suited for a wide range of applications. Its support for dynamic schemas, horizontal scaling, and high performance make it an attractive choice for developers and organizations looking to store and analyze large volumes of data.",
      "imgUrl": "https://source.unsplash.com/720x600/?database,nodejs",
      "publishedAt": "08/01/2023",
      "urlToBlog": "/blogs/mongodb"
    }
  ]
}
